Revit 2027 API
RebarShape.RebarShapeMatchesCurvesAndTerminationsData Method
 Checks if rebarShape matches curves and terminations data. If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to false, then this method will ignore the hook information. If the RebarShapeDefinesEndTreatment flag in ReinforcementSettings has been set to false, then this method will ignore the end treatment information.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool RebarShapeMatchesCurvesAndTerminationsData(
	RebarShape rebarShape,
	RebarBarType barType,
	XYZ norm,
	IList<Curve> curves,
	RebarShapeTerminationsData rebarShapeTerminationsData
)
Public Shared Function RebarShapeMatchesCurvesAndTerminationsData (
	rebarShape As RebarShape,
	barType As RebarBarType,
	norm As XYZ,
	curves As IList(Of Curve),
	rebarShapeTerminationsData As RebarShapeTerminationsData
) As Boolean
public:
static bool RebarShapeMatchesCurvesAndTerminationsData(
	RebarShape^ rebarShape,
	RebarBarType^ barType,
	XYZ^ norm,
	IList<Curve^>^ curves,
	RebarShapeTerminationsData^ rebarShapeTerminationsData
)
static member RebarShapeMatchesCurvesAndTerminationsData :
        rebarShape : RebarShape *
        barType : RebarBarType *
        norm : XYZ *
        curves : IList<Curve> *
        rebarShapeTerminationsData : RebarShapeTerminationsData -> bool
Parameters
rebarShape RebarShape
 A RebarShape element that defines the shape of the rebar.
barType RebarBarType
 A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
norm XYZ
 The normal to the plane that the rebar curves lie on.
curves IList<Curve>
 An array of curves that define the shape of the rebar curves. They must belong to the plane defined by the normal and origin. Bends, hooks and cranks should not be included in the array of curves.
rebarShapeTerminationsData RebarShapeTerminationsData
 Data about the Rebar Shape's terminations.
Return Value
Boolean
 True if rebarShape matches curves and termination data.
Exceptions
Exception | Condition
ArgumentException |  The input curves is empty. -or- The input curves contains at least one curve which is not a bound Line or bound Arc and is not supported for this operation. -or- curves do not form a valid CurveLoop. -or- The input curves contains at least one helical curve and is not supported for this operation. -or- The rebarShapeTerminationsData was not created using the rebarShape's document. -or- The rebarShapeTerminationsData was not created using the barType's document.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  norm has zero length.
See Also
Reference
RebarShape Class
Autodesk.Revit.DB.Structure Namespace